---
title: OrdinateDimensionSetting
classe: Autodesk.Revit.DB.OrdinateDimensionSetting
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# OrdinateDimensionSetting

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double DimensionLineLength { get; set; }` | `ordinateDimensionSetting.DimensionLineLength` | Double |
| `OrdinateDimensionLineStyle DimensionLineStyle { get; set; }` | `ordinateDimensionSetting.DimensionLineStyle` | OrdinateDimensionLineStyle |
| `Boolean IsValidObject { get; }` | `ordinateDimensionSetting.IsValidObject` | Boolean |
| `ElementId OriginTickMarkId { get; set; }` | `ordinateDimensionSetting.OriginTickMarkId` | ElementId |
| `OrdinateOriginVisibility OriginVisibility { get; set; }` | `ordinateDimensionSetting.OriginVisibility` | OrdinateOriginVisibility |
| `OrdinateTextOrientation TextOrientation { get; set; }` | `ordinateDimensionSetting.TextOrientation` | OrdinateTextOrientation |
| `OrdinateTextPosition TextPosition { get; set; }` | `ordinateDimensionSetting.TextPosition` | OrdinateTextPosition |
| `Void Dispose()` | `ordinateDimensionSetting.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```